sources/InformationRegisters/Графики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Графики</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодУчебы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Группы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипМероприятия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИсполения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

sources/Enums/ТипыМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыМероприятий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОчноеОбучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Практика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Каникулы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаочноеОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

sources/Enums/СрокиНапоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СрокиНапоминания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНапоминать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

sources/Enums/Важности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Важности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Критично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредняяВажность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Некритично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

sources/Documents/СозданиеЗаметки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СозданиеЗаметки</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Важности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаметки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаметок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокНапоминанияОСобытии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокиНапоминания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Преподаватели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

sources/CommonModules/РаботаСУведомлениями/Ext/Module.bsl
// Получает список уведомлений о группах, которые на практике на текущую дату
//
// Параметры:
//  ТекДата  - Дата - содержит текущую дату
//
// Возвращаемое значение:
//   Массив   - Содержит структуры (Текст - Строка)
//
Функция СформироватьСписокУведомленийОГруппах(ТекДата) Экспорт
	
	МассивУведомлений = Новый Массив;
	
	УчебныйГод = РаботаССеансом.ПолучитьНачалоИКонецУчебногоГода();
	Если УчебныйГод.Количество() = 0 Тогда
	
		 Возврат МассивУведомлений;
	
	 КонецЕсли;
	 
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Графики.Группа КАК Группа
		|ИЗ
		|	РегистрСведений.Графики КАК Графики
		|ГДЕ
		|	Графики.ПериодУчебы = &ПериодУчебы
		|	И Графики.Начало <= &ТекДата
		|	И Графики.Окончание >= &ТекДата
		|	И Графики.ТипМероприятия = &ТипМероприятия";
	
	Запрос.УстановитьПараметр("ТекДата", ТекДата);
	Запрос.УстановитьПараметр("ТипМероприятия", Перечисления.ТипыМероприятий.Практика);
	Запрос.УстановитьПараметр("ПериодУчебы", УчебныйГод.Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураУведомления = Новый Структура;
		СтруктураУведомления.Вставить("Текст", "Группа " + ВыборкаДетальныеЗаписи.Группа + " на практике");
		МассивУведомлений.Добавить(СтруктураУведомления);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	Возврат МассивУведомлений;

КонецФункции

 // Получает список уведомлений о заметках, которые указаны с напоминанием
//
// Параметры:
//  ТекДата  - Дата - содержит текущую дату
//
// Возвращаемое значение:
//   Массив   - Содержит структуры (Текст - Строка, Ссылка - НавигационнаяСсылка, Важность - Строка)
//
Функция СформироватьСписокУведомленийОЗаметках(ТекДата) Экспорт
	
	МассивУведомлений = Новый Массив;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СозданиеЗаметки.Ссылка КАК Ссылка,
		|	СозданиеЗаметки.Важность КАК Важность,
		|	СозданиеЗаметки.Заголовок КАК Заголовок,
		|	СозданиеЗаметки.СрокНапоминанияОСобытии КАК СрокНапоминанияОСобытии,
		|	СозданиеЗаметки.Дата КАК Дата
		|ИЗ
		|	Документ.СозданиеЗаметки КАК СозданиеЗаметки
		|ГДЕ
		|	СозданиеЗаметки.Выполнено = ЛОЖЬ
		|	И СозданиеЗаметки.СрокНапоминанияОСобытии <> &СрокНапоминанияОСобытии
		|	И СозданиеЗаметки.Преподаватель = &Преподаватель";
	
	Запрос.Параметры.Вставить("СрокНапоминанияОСобытии",Перечисления.СрокиНапоминания.НеНапоминать);
	Запрос.Параметры.Вставить("Преподаватель",ПараметрыСеанса.ТекПользователь);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДатаНачалаНапоминания = ВыборкаДетальныеЗаписи.Дата - ПреобразоватьСрокУведомленияВСекунды(ВыборкаДетальныеЗаписи.СрокНапоминанияОСобытии);
		Если ТекДата >= ДатаНачалаНапоминания Тогда
		
			СтруктураУведомления = Новый Структура;
			СтруктураУведомления.Вставить("Текст", ВыборкаДетальныеЗаписи.Заголовок);
			СтруктураУведомления.Вставить("Ссылка", ПолучитьНавигационнуюСсылку(ВыборкаДетальныеЗаписи.Ссылка));
				Если ВыборкаДетальныеЗаписи.Важность = Перечисления.Важности.Критично Тогда
				
					 СтруктураУведомления.Вставить("Важность", "Критично");
				
				Иначе
				
					 СтруктураУведомления.Вставить("Важность", "Некритично");
				
				КонецЕсли;
			
			МассивУведомлений.Добавить(СтруктураУведомления);
		
		КонецЕсли;
		
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	Возврат МассивУведомлений;

КонецФункции

// Переводит срок уведомления заметки в секунды
//
// Параметры:
//  СрокУведомления  - Перечисление.СрокиНапоминания - содержит перечисление
//
// Возвращаемое значение:
//   Число   - Содержит срок в секундах
//
Функция ПреобразоватьСрокУведомленияВСекунды(СрокУведомления)

	Если СрокУведомления = Перечисления.СрокиНапоминания.День Тогда
	
		 Возврат 60*24*60;
	
	 КонецЕсли;
	 Если СрокУведомления = Перечисления.СрокиНапоминания.День2 Тогда
	
		 Возврат 60*24*60*2;
	
	 КонецЕсли;
	 Если СрокУведомления = Перечисления.СрокиНапоминания.День3 Тогда
	
		 Возврат 60*24*60*3;
	
	 КонецЕсли;
	 Если СрокУведомления = Перечисления.СрокиНапоминания.Час Тогда
	
		 Возврат 60*60;
	
	 КонецЕсли;
	 Если СрокУведомления = Перечисления.СрокиНапоминания.Час2 Тогда
	
		 Возврат 60*2*60;
	
	 КонецЕсли;
	 Если СрокУведомления = Перечисления.СрокиНапоминания.Час3 Тогда
	
		 Возврат 60*3*60;
	
	 КонецЕсли;
	 Если СрокУведомления = Перечисления.СрокиНапоминания.Час6 Тогда
	
		 Возврат 60*6*60;
	
	 КонецЕсли;
	 Если СрокУведомления = Перечисления.СрокиНапоминания.Час12 Тогда
	
		 Возврат 60*12*60;
	
	 КонецЕсли;
	 Если СрокУведомления = Перечисления.СрокиНапоминания.Неделя Тогда
	
		 Возврат 60*24*60*7;
	
	 КонецЕсли;
	 Если СрокУведомления = Перечисления.СрокиНапоминания.Неделя2 Тогда
	
		 Возврат 60*24*60*14;
	
	 КонецЕсли;
	 Если СрокУведомления = Перечисления.СрокиНапоминания.Неделя3 Тогда
	
		 Возврат 60*24*60*21;
	
	 КонецЕсли;
	 Если СрокУведомления = Перечисления.СрокиНапоминания.Месяц Тогда
	
		 Возврат 60*24*60*28;
	
	КонецЕсли;

КонецФункции // ПреобразоватьСрокУведомленияВСекунды()
